Repository: vulcanus-enigma/e2openplugin-EnhancedMovieCenter
Catalog: locale/*/LC_MESSAGES/Suomipoeka.po
Languages: fi

source: Directory
fi: Hakemisto

source: show event details
fi: Näytä tallennetun ohjelman kuvaus/lisätiedot

source: Stop playback
fi: Keskeytä toisto

source: Open extensions menu
fi: Avaa laajennusten valikko

source: Skipping movie, the file does not exist.
fi: Tallenne ohitetaan, tiedostoa ei löydy.

source: Alpha sort
fi: Aakkosjärj.

source: Play selected movie(s)
fi: Toista valitut tallenteet

source: Close movie list
fi: Sulje tallenneluettelo

source: Open menu
fi: Avaa valikko

source: Show event info
fi: Tallennetun ohjelman kuvaus/lisätiedot

source: Delete file or empty dir
fi: Poista tallenne tai tyhjä hakemisto

source: Toggle sort mode
fi: Vaihda listan järjestystapaa

source: Move selected movie(s)
fi: Siirrä valittu tallenteet

source: Movie home / Play last (configurable)
fi: Tallenteiden kotihakemisto / toista viimeinen (valittava)

source: Move cursor page up
fi: Listassa sivu ylöspäin

source: Move cursor page down
fi: Listassa sivu alaspäin

source: Move cursor up
fi: Liikuta kursoria ylöspäin

source: Move cursor down
fi: Liikuta kursoria alaspäin

source: Move cursor 1/2 page up
fi: Listassa 1/2 sivua ylöspäin

source: Move cursor 1/2 page down
fi: Listassa 1/2 sivua alaspäin

source: Toggle service selection
fi: Tallenteen monivalinta päälle / pois

source: Available plugins menu
fi: Tallennelistan laajennustoiminnot

source: Reload movie file list
fi: Päivitä tallenneluettelo

source: Toggle viewed / not viewed
fi: Muuta kerran avatuksi tai avaamattomaksi

source: Start / end multiselection
fi: Tallenteiden monivalinnan alku / loppu

source: Delete
fi: Poista

source: Move
fi: Siirrä

source: Last played movie/playlist not available...
fi: Viimeisin toistettu tallenne/soittolista ei ole saatavilla...

source: Permanently delete all files in trashcan?
fi: Poista pysyvästi kaikki roskakorista?

source: Directory is not empty.
fi: Hakemisto ei ole tyhjä.

source: Cannot delete the parent directory.
fi: Hakemistopuun ylempää hakemistoa ei voi poistaa.

source: File not available.
fi: Tallenne ei ole saatavilla.

source: Stop ongoing recording?
fi: Pysäytetäänkö tallennus?

source: Not stopping any repeating timers. Modify them with the timer editor.
fi: Toistuvia ajastuksia ei poisteta, niitä on suositeltavaa muuttaa manuaalisesti ajastimien hallinnan kautta.

source: Deleting remotely recorded and it will display an rec-error dialog on the other DB.
fi: Poisto kohdistuu etätallennukseen ja aiheuttaa tallennusvirhe-dialogin tallentavalla Dreamboxilla.

source: permanently
fi: pysyvästi

source: currently played?
fi: (katselu kesken) ?

source: all selected video files?
fi: kaikki valitut tallenteet?

source: all selected video files? The currently playing movie is also one of the selections and its playback will be stopped.
fi: kaikki valitut tallenteet? Toistettava tallenne on myös yksi valituista ja sen toisto pysäytetään.

source: Delete error:
fi: Virhe poistamisessa:

source: Delete failed because the trashcan directory does not exist. Attempt to create it now?
fi: Poistaminen epäonnistui koska roskakori-hakemistoa ei ole. Luodaanko se nyt?

source: Date sort
fi: Aikajärj.

source: Error: path '%s' not available!
fi: Virhe: polkua '%s' ei löydy!

source: *** Multiselection active ***
fi: *** Monivalinta aktiivinen ***

source: How to move files: Select some movies with the VIDEO-button, move the cursor on top of the destination directory and press yellow.
fi: Tallenteiden siirtäminen: Valitse tallenteet VIDEO-napilla, siirrä kursori kohde hakemiston päälleja paina keltaista nappia.

source: Select Location
fi: Valitse hakemisto

source: Choose directory
fi: Valitse hakemisto

source: Trashcan create failed. Check mounts and permissions.
fi: Roskakorin luominen epäonnistui. Tarkista hakemistojen oikeudet.

source: Choose operation
fi: Valitse toiminto

source: Play last
fi: Viim.toistettu

source: Movie home
fi: Kotihakemisto

source: Delete permanently
fi: Poista pysyvästi

source: Empty trashcan
fi: Tyhjennä roskakori

source: Go to trashcan
fi: Siirry roskakoriin

source: Remove rogue files
fi: Poista turhat meta tiedostot

source: Create link(s)
fi: Luo linkit

source: Create directory
fi: Luo hakemisto

source: Bookmark directory
fi: Kirjanmerkitse hakemisto

source: Bookmarks
fi: Kirjanmerkit

source: Choose plugin
fi: Valitse lisäosatoiminto

source: Choose bookmark
fi: Valitse kirjanmerkki

source: Movie Selection Menu
fi: Tallenneluettelon valikko

source: Enter name for new directory.
fi: Määritä nimi uudelle hakemistolle

source: Directory
fi: Hakemisto

source: Locate rogue files and remove them? (permanently if no trashcan available, may take a minute or so)
fi: Poistetaanko turhat meta tiedostot? (lopullisesti jos roskakoria ei ole, voi kestää muutaman minuutin)

source: files
fi: tiedostot

source: No rogue files found.
fi: Ei turhia meta tiedostoja.

source: Found rogue files:
fi: Löydetyt turhat meta tiedostot

source: Cancel
fi: Peruuta

source: Save
fi: Tallenna

source: About
fi: Lisätiedot

source: Button to override for MovieList launch
fi: Tallenneluettelon avausnappi

source: Show plugin config in extensions menu
fi: Asetusruudun avaus myös laajennusvalikossa

source: Show MovieList in extensions menu
fi: Tallenneluettelon avaus myös laajennusvalikossa

source: Preferred EPG language
fi: Ohjelmaoppaan kieli

source: Primary playback subtitle language
fi: Toiston 1. tekstityskieli

source: Secondary playback subtitle language
fi: Toiston 2. tekstityskieli

source: Tertiary playback subtitle language
fi: Toiston 3. tekstityskieli

source: Enable playback auto-subtitling
fi: Aktivoi toiston automaattinen tekstitys

source: Movie home auto-update perms (chmod)
fi: Tallennehakemiston oikeuksien autom. päivitys

source: Movie home chmod permission value
fi: Tallennehakemiston oikeuksien määritys

source: Movie home home path
fi: Kotihakemisto-toiminnon oletushakemisto

source: Movie trashcan path
fi: Roskakorin hakemisto

source: How many days files may remain in trashcan
fi: Montako päivää tallenteita säilytetään roskakorissa

source: Disable MovieList
fi: Tallenneluettelo pois käytöstä

source: MovieList path access limit
fi: Tallennehakemistosta pääsyn rajoitus

source: MovieList disable desc field
fi: Piilota tallenneluettelon lisätietokenttä

source: MovieList desc field update delay
fi: Tallenneluettelon lisätietokentän päivitysviive

source: MovieList file order reverse
fi: Tallenneluettelo: uusin tallenne alimpana

source: MovieList open with cursor on newest (TV mode)
fi: Tallenneluettelon avaus: kursori uusimpaan (TV-tila)

source: MovieList open with cursor on newest (player)
fi: Tallenneluettelon avaus: kursori uusimpaan (toisto)

source: MovieList cursor predictive move after selection
fi: Tallenneluettelon kursorin ennakointi valitessa

source: MovieList file dates on left side
fi: Tallenneluettelo: päiväys vasemmalla

source: MovieList show movie icons
fi: Näytetäänkö tallenteille ikonit?

source: MovieList show icon indication for non-watched
fi: Näytetäänkö punainen ikoni ei-katsotuille

source: MovieList try to load titles from .meta files
fi: Ladataanko ohjelmien nimet .meta tiedostoista

source: MovieList re-open list after STOP-press
fi: Avaa tallenneluettelo toiston pysäyttämisen jälkeen

source: MovieList always reload after open
fi: Päivitä tallenneluettelo aina avattaessa

source: MovieList blue button function
fi: Tallenneluettelon sinisen napin toiminto

source: MovieList cifs* files operation
fi: Tallennehakemiston cifs*-tiedostot

source: MovieList hide movies being moved
fi: Piilota siirrettävät tallenteet heti tallenneluettelosta

source: MovieList hide movies being deleted
fi: Piilota poistettavat tallenteet heti tallenneluettelosta

source: MovieList hide trashcan directory
fi: Piilota roskakorin hakemisto

source: Automatic timers list cleaning
fi: Automaattinen menneiden ajastuksien poisto

source: Enigma daily auto-restart
fi: Enigman päivittäinen uudelleenkäynnistys

source: Enigma auto-restart window begin
fi: Uudelleenkäynnistyksen aikaikkunan alku

source: Enigma auto-restart window end
fi: Uudelleenkäynnistyksen aikaikkunan loppu

source: Force standby after auto-restart
fi: Valmiustila uudelleenkäynnistyksen jälkeen

source: Suomipoeka output directory
fi: Suomipoeka asetus/loki hakemisto

source: Enable Suomipoeka debug output
fi: Aktivoi debug-tiedosto

source: Debug output file name
fi: Debug-tiedoston nimi

source: Key period value (30-900)
fi: Kauko-ohjaimen toistonopeus (30-900)

source: Key repeat value (250-900)
fi: Kauko-ohjaimen toistoviive (250-900)

source: Enable component video in A/V Settings
fi: Komponenttilähtö valittavissa video-ulostuloksi

source: Given path %s does not exist. Please change.
fi: Hakemistoa %s ei löydy, vaihto suositeltavaa.

source: Some settings changes require GUI restart to take effect.
fi: Asetuksien muutos vaatii Enigma2:n uudelleenkäynnistämisen

source: Next Enigma auto-restart in
fi: Seuraavaan Enigman automaattiseen käynnistykeseen on

source: Enigma auto-restart is currently not active.
fi: Enigman automaattinen uudelleen käynnistys ei ole päällä.

source: Suomipoeka Enigma2 auto-restart launching, continue? Select no to postpone by one hour.
fi: Suomipoeka automaattinen Enigma2 käynnistys aktivoituu, jatketaanko? Kielto siirtää tunnilla eteenpäin.

source: English
fi: Englanti

source: down
fi: alas

source: up/down
fi: ylös/alas

source: off
fi: ei käytössä

source: unhide
fi: näytä

source: delete
fi: poista

source: do nothing
fi: ei toimintoa

source: No override
fi: Ei käytössä

source: Video-button
fi: Video-nappi

source: TV-button
fi: TV-nappi

source: Radio-button
fi: Radio-nappi

source: Quick-button
fi: Pika-nappi

source: Timeshift-button
fi: Ajansiirto-nappi

source: configuration
fi: asetukset

source: movie manipulation list
fi: tallenneluettelo
